Repository: landv/gambas
Catalog: app/src/gambas2-database-manager/.lang/*.po
Languages: el

source: &1 records
el: &1 εγγραφές

source: &1 records imported.
el: &1 εγγραφές εισήχθησαν.

source: About...
el: Σχετικά...

source: All files
el: Ότα τα αρχεία

source: (Automatic key)
el: (Αυτόματο κλειδί)

source: Boolean
el: Λογικός τύπος

source: Cancel
el: Άκυρο

source: Cancelled by user
el: Ακυρώθηκε από τον χρήστη

source: Cannot close database.
el: Δεν μπορεί να κλείσω την βάση δεδομένων.

source: Cannot connect to database
el: Δεν μπορώ να συνδεθώ στην βάση δεδομένων

source: Cannot connect to database '&1'
el: Δεν μπορώ να συνδεθώ στην βάση δεδομένων '&1'

source: Cannot connect to server
el: Δεν μπορώ να συνδεθώ στον διακομιστή

source: Cannot copy database.
el: Δεν μπορώ να αντιγράψω την βάση δεδομένων

source: Cannot create database.
el: Δεν μπορώ να δημιουργήσω την βάση δεδομένων

source: Cannot create table '&1'.
el: Δεν μπορώ να δημιουργήσω τον πίνακα '&1'

source: Cannot create user.
el: Δεν μπορώ να δημιουργήσω τον χρήστη.

source: Cannot delete database.
el: Δεν μπορώ να διαγράψω την βάση δεδομένων.

source: Cannot delete table '&1'.
el: Δεν μπορώ να διαγράψω τον πίνακα '&1'.

source: Cannot delete user.
el: Δεν μπορώ να διαγράψω τον χρήστη.

source: Cannot edit user.
el: Δεν μπορώ να επεξεργαστώ τν χρήστη.

source: Cannot exec request.
el: Δεν μπορώ να εκτελέσω το αίτημα.

source: Cannot export data.
el: Δεν μπορώ να εξάγω τα δεδομένα.

source: Cannot generate Gambas code.
el: Δεν μπορώ να παράγω κώδικα Gambas.

source: Cannot load SQL script file.
el: Δεν μπορώ να φορτώσω αρχείο κώδικα SQL.

source: Cannot open table.
el: Δεν μπορώ να ανοίξω τον πίνακα.

source: Cannot read table data.
el: Δεν μπορώ να διαβάσω τα δεδομένα του πίνακα.

source: Cannot refresh connection.
el: Δεν μπορώ να ανανεώσω την σύνδεση.

source: Cannot save SQL script file.
el: Δεν μπορώ να αποθηκεύσω τον κώδικα αρχείου SQL

source: Cannot write table.
el: Δεν μπορώ να γράψω τον πίνακα.

source: Cannot write table data.
el: Δεν μπορώ να γράψω δεδομένα πίνακα.

source: Charset
el: Σύνολο χαρακτήρων

source: Choose...
el: Επιλέξτε...

source: Close
el: Κλείσιμο

source: &Close
el: &Κλείσιμο

source: &Close all
el: &Κλείσιμο όλων

source: Connection
el: Σύνδεση

source: Continue
el: Συνέχισε

source: &Copy
el: &Αντιγραφή

source: Copy data in clipboard
el: Αντιγραφή δεδομένων στο πρόχειρο

source: Copy structure &and data
el: Αντιγραφή δομής &και δεδοένων

source: Copy &structure only
el: Αντιγραφή &δεδομένων μόνο

source: &Create...
el: &Δημιουργία

source: &Create database...
el: &Δημιουργία βάσης δεδομένων

source: Create database
el: Δημιουργία βάσης δεδομένων

source: &Create table...
el: &Δημιουργία πίνακα

source: Create table
el: Δημιουργία πίνακα

source: &Create user...
el: &Δημιουργία χρήστη

source: Create user
el: Δημιουργία χρήστη

source: CSV files
el: Αρχεία CSV

source: Data
el: Δεδομένα

source: Database
el: Βάση δεδομένων

source: Database: &1
el: Βάση δεδομένων: &1

source: &Database component debugging
el: &Αποσφαλμάτωση στοιχείου βάσης δεδομένων

source: Date
el: Ημερομηνία

source: Default value
el: Προκαθορισμένη τιμή

source: Delete
el: Διαγραφή

source: &Delete
el: &Διαγραφή

source: Delete field
el: Διαγραφή πεδίου

source: Delete index field
el: Διαγραφή πεδιου ευρετηρίου

source: Delete record
el: Διαγραφή εγγραφής

source: Delimiter character
el: Οριοθέτης

source: Destination
el: Προορισμός

source: Do not save
el: Μην σώσεις

source: Do you really want to delete the database '&1' ? BE CAREFUL ! All your data will be lost.
el: Θέλετε πραγματικά να διαγράψετε την βάση δεδομένων '&1' ; ΠΡΟΣΟΧΗ ! Όλα τα δεδομένα θα χαθούν.

source: Do you really want to delete the table '&1' ?
el: Θέλετε πραγματικά να διαγράψετε τον πίνακα '&1' ;

source: Do you really want to delete the user '&1' ?
el: Θέλετε πραγματικά να διαγράψετε τον χρήστη '&1' ;

source: Do you really want to reload the table definition ?
el: Θέλετε πραγματικά να επαναφορτώσετε τον καθορισμό του πίνακα ;

source: Do you really want to remove all servers ?
el: Θέλετε πραγματικά να αφαιρέσετε όλους τους διακομιστές ;

source: Do you really want to remove the following server ? &1
el: Θέλετε πραγματικά να αφαιρέσετε τον παρακάτω διακομιστή ; &1

source: Duplicate
el: Αντίγραφο

source: Duplicate database
el: Αντίγραφο βάσης δεδομένων

source: Duplicate table
el: Αντίγραφο πίνακα

source: &Edit...
el: &Επεξεργασία

source: Edit user
el: Επεξεργασία χρήστη

source: Enclose character
el: Εσωκλεισμός χαρακτήρα

source: End of line
el: Τέλος αρχείου

source: Enter your request...
el: Εισάγετε το αίτημα σας...

source: Export data
el: Εξαγωγή δεδομένων

source: Field
el: Πεδίο

source: Field_&1
el: Πεδίο_&1

source: Fields
el: Πεδία

source: Find
el: Εύρεση

source: Gambas Database Manager
el: Διαχειιστής βάσεων δεδομένων Gambas

source: Generate
el: Παράγετε

source: Generate Gambas code
el: Παραγωγή κώδικα Gambas

source: <h1 align=center>Gambas Database<br>Manager</h1> <b>(c) Benoît Minisini 2007</b><br><br> <p align=center>This program is FREE SOFTWARE; you can redistribute it AND/OR modify it under the terms of the GNU General Public License as published by the Free Software Foundation ; either version 2, or (at your option) any later version.</p> <p align=center>This program is distributed in the hope that it will be useful but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.</p>
el: <h1 align=center>Διαχειριτής βάσεων δεδομένων<br>Gambas</h1> <b>(c) Benoît Minisini 2007</b><br><br> <p align=center>Αυτο το πρόγραμμα είναι ΕΛΕΥΘΕΡΟ ΛΟΓΙΣΜΙΚΟ, μπορείτε να το διανέμετε ΚΑΙ/Ή τροποποιήσετε υπό τους όρους της άδειας GNU General Public License όπως αυτή έχει δημοσιευτέι από το Ίδρυμα Ελεύθερου Λογισμικού, είτε έκδοση 2, ή (κατά την προτίμιση σας) όποια νεότερηέκδοση.</p> <p align=center>Αυτό το πρόγραμμα διανέμετε με την ελπίδα να είναι χρήσιμο αλλά ΧΩΡΙΣ ΚΑΜΙΑ ΕΓΓΥΗΣΗ. Δες την άδεια GNU General Public License για περισσότερες λεπτομέρειες .</p> </p>

source: Import
el: Εισαγωγή

source: &Import CSV file...
el: &Εισαγωγή αρχείου CSV...

source: Import CSV file
el: Εισαγωγή αρχείου CSV.

source: Incorrect value.
el: Λάθος τιμή

source: Index
el: Ευρετήριο

source: Indexes
el: Ευρετήρια

source: Integer
el: Ακέραιος

source: Key field
el: Πεδίο κλειδιού

source: Length
el: Μήκος

source: Load request
el: Φόρτωση αιτήματος

source: &Make Gambas code...
el: &Φτιάξε κώδικα Gambas...

source: Messages
el: Μηνύματα

source: modified
el: τροποποιημένο

source: Module
el: Μονάδα

source: Move field down
el: Μετακίνησε το πεδίο κάτω

source: Move field up
el: Μετακίνησε το πεδίο πάνω

source: Name
el: Όνομα

source: New connection
el: Νέα σύνδεση

source: New field
el: Νέο πεδίο

source: New index
el: Νέο ευρετήριο

source: New index field
el: Νέο ευρετήριο και πεδίο

source: New record
el: Νέα εγγραφή

source: New request
el: Νέο αίτημα

source: &New server...
el: &Νεός διακομιστής...

source: New server
el: Νεός διακομιστής

source: No record imported.
el: Δεν εισήχθη εγγραφή.

source: No records.
el: Δεν υπάρχουν εγγραφές

source: Not enough values
el: Δεν υπάρχουν αρκετές τιμές

source: OK
el: Εντάξει

source: One record
el: Μία εγγραφή

source: One record imported.
el: Μία εγγραφή εισήχθη

source: &Open
el: &Άνοιγμα

source: Options
el: Επιλογές

source: Password
el: Κωδικός

source: &Paste...
el: &Επικόλληση

source: &Paste database...
el: &Επικόλληση βάσης δεδομένων

source: &Paste table...
el: &Επικόλληση πίνακα

source: Path
el: Διαδρομή

source: Please enter a database name.
el: Παρακαλούμε εισαετε ένα όνομα βάσης δεδομένων.

source: Please enter a module name.
el: Παρακαλούμε εισάγετε ένα όνομα μονάδας.

source: Please enter a number.
el: Παρακαλούμε εισάγετε έναν αριθμό.

source: Please enter a procedure name.
el: Παρακαλούμε εισάγετε όνομα υπορουτίνας.

source: Please enter a table name.
el: Παρακαλούμε εισάγετε όνομα πίνακα.

source: Please enter at least eight characters.
el: Παρακαλούμε εισάγετε τουλάχιστον οκτώ χαρακτήρες.

source: Please enter the key string used for crypting database passwords.
el: Παρακαλούμε εισάγετε το κλειδί χαρακτήρων που χρησιμοποιήθηκε για την κρυπτογράφηση των κωδικών της βάσης δεδομένων.

source: Please type a database name.
el: Παρακαλούμε πληκτρολογείστε ένα όνομα βάσης δεδομένων.

source: Please type a user name.
el: Παρακαλούμε πληκτρολογείστε ένα όνομα χρήστη.

source: Preview
el: Προεπισκόπίση

source: Procedure
el: Υπορουτίνα

source: Project
el: Έργο

source: Quit
el: Έξοδος

source: &Quit
el: &Έξοδος

source: &Refresh
el: &Ανανέωση

source: Reload
el: Ξαναφόρτωμα

source: Reload data
el: Ξαναφόρτωσε τα δεδομένα

source: Reload table
el: Ξαναφόρτωσε τον πίνακα

source: Remove
el: Αφαίρεση

source: &Remove
el: &Αφαίρεση

source: Remove all
el: Αφαίρεση όλων

source: Re&move all servers
el: Αφ&αίρεση όλων των διακομιστών

source: &Rename...
el: &Μετονομασία

source: Rename table
el: Μετονομασία πίνακα

source: Run
el: Εκτέλεση

source: Save
el: Αποθήκευση

source: Save data
el: Αποθήκευση δεδομένων

source: Save request
el: Αποθήκευση αίτησης

source: Save table
el: Αποθήκευση πίνακα

source: &Scan database servers
el: &Ανίχνευση διακομιστών βάσης δεδομένων

source: Select a &1 database
el: Επιλέξτε μία &1 βάση δεδομένων

source: Select the CSV file to import
el: Επιλέξτε το αρχείο CSV για εισαγωγή

source: Serial
el: Σειριακός αριθμός

source: Server
el: Διακομιστής

source: &Server
el: &Διακομιστής

source: Server: &1
el: Διακομιστής: &1

source: Show system tables
el: Εμφάνιση πινάκων συστήματος

source: Source
el: Πηγαίος κώδικας

source: Space
el: κενό

source: &SQL request...
el: &Αίτημα SQL...

source: SQL request
el: Αίτημα SQL

source: SQL script files
el: Αρχείο κώδικα SQL

source: String
el: Στοιχειοσειρά

source: Strip useless white spaces
el: Αφαίρεσαι άχρηστα κενά

source: Table
el: Πίνακας

source: Table already exists
el: Ο πίνακας ήδη υπάρχει.

source: The data of table '&1' have been modified. Do you want to save it ?
el: Τα δεδομένα του πίνακα '&1' έχουν τροποποιηθεί. Θέλετε να τα αποθηκεύσετε ;

source: The first line contains field names
el: Η πρώτη γραμμή περιέχει ονόματα πεδίων

source: The length must be greater than 1 and lower than 255.
el: Το μήκος πρέπει να είναι μεγαλύτερο από 1 και μικρότερο από 255.

source: The table '&1' has been modified. Do you want to save it ?
el: Ο πίνακας '&1' έχει τροποποιηθεί. Θέλετε να τον αποθηκεύσετε ;

source: This dialog allows you to generate a <b>Gambas</b> procedure that will initialize the structure of your database.
el: Αυτό το πλαίσιο διαλόγου σας επιτρέπει να παράγετε μια υπορουτίνα της <b>Gambas</b> με την οποία θα αρχικοποιήσετε την δομή της βάσης δεδομένων σας.

source: This field cannot be void.
el: Το πεδίο δεν μπορεί να είναι κενό

source: This field is used in an index.
el: Αυτό το πεδίο χρησιμοποιείται ως δείκτης.

source: This name already exists.
el: Το όνομα ήδη υπάρχει.

source: This table name is already in use.
el: Το όνομα του πίνακα ήδη είναι σε χρήση.

source: This user is a database administrator
el: Ο χρήστης είναι διαχειριστής βάσης δεδομένων

source: Toggle primary key
el: Επιλέξτε πρωτεύον κλειδί

source: Too many values
el: Πάρα πολλές τιμές

source: Type
el: Τύπος

source: Unique
el: Μοναδικό

source: unlimited
el: απεριόριστο

source: Update at database close.
el: Ενημέρωση στο κλείσιμο της βάσης

source: &Use encoding (&1)
el: &Χρησιμοποιείστε κωδικοποίηση (&1)

source: User
el: Χρήστης

source: Users
el: Χρήστες

source: You must define a primary key.
el: Πρέπει να ορίσετε ένα πρωτεύον κλειδί.
