Repository: landv/gambas
Catalog: app/other/MakeWebSite/.lang/*.po
Languages: cs

source: <b><i>Gambas</i></b> is a free development environment based on a <i>Basic</i> interpreter with object extensions, a bit like <i>Visual Basic&#8482;</i> (but it is <i><b>NOT</b></i> a clone&nbsp;!).
cs: <b><i>Gambas</i></b> je svobodné vývojové prostředí založené na interpreteru <i>Basicu</i> s objektovým rozšířením, tak trochu jako <i>Visual Basic&#8482;</i> (ale <i><b>NENÍ</b></i> to klon&nbsp;!).

source: Arabic
cs: Arabsky

source: Architecture
cs: Architektura

source: Books
cs: Knihy

source: Browse Source Code
cs: Procházet zdrojový kód

source: Bug tracker
cs: Hlášení chyb

source: Catalonia
cs: Katalánsky

source: Click there to see all news
cs: Zde kliknout pro zobrazení všech novinek

source: Compilation &amp; Installation
cs: Kompilace &amp; Instalace

source: Country
cs: Země

source: Czech Republic
cs: Česky

source: Developer
cs: Vývojář

source: Developers
cs: Vývojáři

source: Distributions &amp; O.S.
cs: Distribuce &amp; O.S.

source: Documentation
cs: Dokumentace

source: Donate with PayPal
cs: Přispět s PayPal

source: English
cs: Anglicky

source: Flattr this
cs: Flattr-tni to

source: French
cs: Francouzky

source: Gambas web site generator
cs: Generátor webové stránky Gambasu

source: Generates Gambas web site from html templates and ChangeLog files.
cs: Gambas generuje webové stránky z HTML šablon a ChangeLog souborů.

source: German
cs: Německy

source: Hall Of Fame
cs: Síň slávy

source: Home
cs: Domů

source: Chinese
cs: Čínsky

source: If you are developing anything directly related to <b><i>Gambas</i></b> or its IDE, and not on the previous list, or if you find a mistake in this list, then write me! And explain me who you are and what you have done, so that I add you to the Hall Of Fame.
cs: Pokud vyvíjíte něco přímo souvisejícího s <i><b>Gambas</b></i>em nebo IDE, a nejste na předchozí seznamu, nebo pokud najdete chybu v tomto seznamu, pak mi napište! A vysvětlete mi, kdo jste a co jste udělal, abych Vás mohl přidat do Síně slávy.

source: If you want to translate <b><i>Gambas</i></b>, write me so that I add you on the previous table, and read the <a href="http://gambasdoc.org/help/howto/translate?view&en">How To</a> carefully.
cs: Pokud chcete překládat <b><i>Gambas</i></b>, napište mi, a já Vás přidám do předchozí tabulky, a pozorně si přečtěte <a href="http://gambasdoc.org/help/howto/translate?view&cs">jak na to</a>.

source: If you want to work on an already existing translation, contact the translators.
cs: Pokud chcete pracovat na již existujícím překladu, obraťte se na překladatele.

source: Introduction
cs: Úvod

source: Korean
cs: Korejsky

source: Language
cs: Jazyk

source: Last news
cs: Poslední novinky

source: License
cs: Licence

source: Mailing lists/Forums
cs: Mailing listy/Fóra

source: No software patents in Europe!
cs: Žádný softwarový patent v Evropě!

source: or by using
cs: nebo pomocí

source: Read the <a href="http://gambasdoc.org/help/doc/intro?view&$(LANG)">introduction</a> for more information.
cs: Přečtěte si <a href="http://gambasdoc.org/help/doc/intro?view&$(LANG)">úvod</a> pro více informací.

source: Release Notes
cs: Poznámky k vydání

source: Reporting a problem
cs: Nahlášení problému

source: Resources
cs: Zdroje

source: Screenshots
cs: Náhledy

source: Some Applications
cs: Některé aplikace

source: Spanish
cs: Španělsky

source: The greatest formula of the world!
cs: Nejlepší vzorec na světě!

source: Translations
cs: Překlady

source: Translator(s)
cs: Překladatelé

source: Turkish
cs: Turecky

source: What is Gambas?
cs: Co je Gambas?

source: Wiki Encyclopaedia
cs: Wiki encyklopedie

source: With <b><i>Gambas</i></b>, you can quickly design your program GUI with QT4 or GTK+, access MySQL, PostgreSQL, ODBC and SQLite databases, pilot applications with <i>D-Bus</i>, translate your program into any language, create network applications easily, make 3D OpenGL applications, make CGI web applications, and so on...
cs: S <b><i>Gambas</i></b>em, můžete rychle navrhnout GUI programu pro QT4 nebo GTK+, s přístupem k MySQL, PostgreSQL, SQLite a ODBC databázím, pilotní aplikace s <i>D-Bus</i>, překládat Váš program do jakéhokoliv jazyka, vytvářet síťové aplikace, snadno vytvořit 3D OpenGL aplikace, vytvářet webové CGI aplikace, a tak dále...

source: Working or have worked on...
cs: Pracují nebo pracovali na...

source: You can support <b><i>Gambas</i></b> by making a small donation with
cs: <b><i>Gambas</i></b> můžete podpořit malým darem přes
