Repository: landv/gambas
Catalog: gb.unittest/.lang/*.po
Languages: de

source: A Gambas component for unittesting and test-driven programming. Forked and inspired from a quite old program: COMUnit (http://comunit.sourceforge.net) and mainly JUnit. Alpha state! Works good, but a project which uses a library which needs gb.deg.unittest requires to install gb.deg.unittest in the project also. Intended to be integrated into the Gambas IDE later on. License GPL V2
de: Eine Gambas Komponente für Unittests und testgesteuerte Entwicklung. Inspiriert von einem älteren Programm: COMUnit (http://comunit.sourceforge.net) und hauptsächlich JUnit. Immer noch Alpha! Funktioniert hervorragend, aber ein Projekt, das eine Bibliothek benutzt, die wiederum mit gb.deg.unittest getestet wird, benötigt ebenfalls die Installation dieser Komponente. Dieses Projekt ist für die spätere Integration in Gambas. Lizenz GPL V2

source: All Test Containers
de: Alle Testcontainer

source: All Test Cases
de: Alle Tests

source: Results
de: Ergebnis

source: Trace
de: Ablauf

source: Containers:
de: Container:

source: Run Tests (Ctrl-r)
de: Starte Tests (Ctrl-r)

source: Press <Esc> to close
de: Beenden mit <Esc>

source: --------------------------------- Test Result ----------------------------------
de: -------------------------------- Testergebnis ----------------------------------

source: Tests done
de: Tests beendet

source: Error in:
de: Fehler in:

source: Error:
de: Fehler:

source: No Errors
de: Keine Errors

source: Failure in:
de: Fehlschlag in:

source: Failure:
de: Fehlschlag:

source: No Failures
de: Keine Fehlschläge

source: --------------------------------- Test End -----------------------------------
de: --------------------------------- Ende Test -----------------------------------

source: Success!
de: Erfolgreich!

source: Not successful... :-(
de: Nicht erfolgreich ... :-(
